
create table if not exists users
(
    id BIGSERIAL,
    name VARCHAR,
    nickname VARCHAR,
    priority_area VARCHAR,
    password VARCHAR,
    role VARCHAR,
    CONSTRAINT pk_users primary key (id)
);

create table if not exists tokens
(
    id BIGSERIAL,
    access_token VARCHAR,
    logged_out BOOLEAN,
    user_id BIGINT,
    CONSTRAINT pk_tokens primary key (id),
    CONSTRAINT fk_token_user_id  FOREIGN KEY (user_id) REFERENCES users (id) ON DELETE CASCADE
);

create table if not exists sports
(
    id BIGSERIAL,
    name VARCHAR,
    CONSTRAINT pk_sports primary key (id)
);

create table if not exists users_sports
(
    id BIGSERIAL,
    level INT,
    user_id BIGINT,
    sport_id BIGINT,
    CONSTRAINT pk_users_sports primary key (id),
    CONSTRAINT fk_user_id  FOREIGN KEY (user_id) REFERENCES users (id) ON DELETE CASCADE,
    CONSTRAINT fk_sport_id  FOREIGN KEY (sport_id) REFERENCES sports (id) ON DELETE CASCADE
);

create table if not exists achievements
(
    id BIGSERIAL,
    info VARCHAR,
    user_id BIGINT,
    CONSTRAINT pk_achievements primary key (id),
    CONSTRAINT fk_achievement_user_id  FOREIGN KEY (user_id) REFERENCES users (id) ON DELETE CASCADE
);

create table if not exists playground
(
    id BIGSERIAL,
    town VARCHAR,
    street VARCHAR,
    type VARCHAR,
    longitude REAL,
    latitude REAL,
    playground_state INT,
    current_book_state BOOLEAN,
    file_data bytea,
    CONSTRAINT pk_playground primary key (id)
);

create table if not exists playground_event
(
    id BIGSERIAL,
    start_time TIMESTAMP,
    user_max_count INT,
    general_collection BOOLEAN,
    playground_id BIGINT,
    CONSTRAINT pk_playground_event primary key (id),
    CONSTRAINT fk_event_playground_id  FOREIGN KEY (playground_id) REFERENCES playground (id) ON DELETE CASCADE
);

create table if not exists playground_prediction
(
    id BIGSERIAL,
    start_time TIMESTAMP,
    user_count INT,
    playground_id BIGINT,
    CONSTRAINT pk_playground_prediction primary key (id),
    CONSTRAINT fk_prediction_playground_id  FOREIGN KEY (playground_id) REFERENCES playground (id) ON DELETE CASCADE
);

create table if not exists user_event
(
    id BIGSERIAL,
    will_come BOOLEAN,
    creator BOOLEAN,
    user_id BIGINT,
    playground_event_id BIGINT,
    CONSTRAINT pk_user_event primary key (id),
    CONSTRAINT fk_event_user_id  FOREIGN KEY (user_id) REFERENCES users (id) ON DELETE CASCADE,
    CONSTRAINT fk_playground_event_id  FOREIGN KEY (playground_event_id) REFERENCES playground_event (id) ON DELETE CASCADE
);


-- Добавление спортивных категорий
insert into sports (name) values
                              ('Футбол'),
                              ('Баскетбол'),
                              ('Волейбол'),
                              ('Бег'),
                              ('Настольный теннис'),
                              ('Бокс');



-- Добавление площадок
insert into playground (town, street, type, longitude, latitude, playground_state, current_book_state, file_data) values
                                                                                                                      ('Нижний Новгород', 'Ленинский район', 'Тренажеры', 43.934994, 56.287042, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Гордеевский м-н, Канавинский район', 'Баскетбол', 43.935508, 56.322633, 2, false, null),
                                                                                                                      ('Нижний Новгород', 'Канавинский район', 'Тренажеры', 43.937042, 56.314763, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Сормовский район', 'Баскетбол', 43.842558, 56.340758, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Сормовский район', 'Воркаут', 43.828099, 56.340427, 2, false, null),
                                                                                                                      ('Нижний Новгород', 'Советский район', 'Тренажеры', 44.005318, 56.294716, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Кузнечиха-2 м-н, Советский район', 'Воркаут', 44.050102, 56.279986, 3, false, null),
                                                                                                                      ('Нижний Новгород', 'ЖК Бурнаковский, Бурнаковский м-н, Московский район', 'Тренажеры', 43.915713, 56.341068, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Молитовский затон м-н, Ленинский район', 'Воркаут', 43.949405, 56.275319, 2, true, null),
                                                                                                                      ('Нижний Новгород', 'Караваиха м-н, Приокский район', 'Тренажеры', 43.976811, 56.263773, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Центральный м-н, Ленинский район', 'Баскетбол', 43.929871, 56.279017, 3, false, null),
                                                                                                                      ('Нижний Новгород', 'Молитовка м-н, Ленинский район', 'Тренажеры', 43.952014, 56.287645, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Молитовка м-н, Ленинский район', 'Воркаут', 43.950272, 56.286684, 2, true, null),
                                                                                                                      ('Нижний Новгород', 'Молитовка м-н, Ленинский район', 'Тренажеры', 43.952181, 56.285971, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Ленинский район', 'Воркаут', 43.937636, 56.290422, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Ленинский район', 'Баскетбол', 43.934129, 56.289565, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Сормовский район', 'Воркаут', 43.839165, 56.342976, 2, false, null),
                                                                                                                      ('Нижний Новгород', 'Красная Этна м-н, Ленинский район', 'Футбол', 43.917195, 56.288852, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Ипподром, микрорайон, г. Нижний Новгород, Нижний Новгород городской округ, Нижегородская область', 'Воркаут', 43.915609, 56.281789, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Щербинки 3 м-н, Приокский район', 'Тренажеры', 43.944793, 56.235346, 2, false, null),
                                                                                                                      ('Нижний Новгород', 'Щербинки 1 м-н, Приокский район', 'Воркаут', 43.962777, 56.238941, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Ленинский район', 'Тренажеры', 43.910592, 56.26317, 2, false, null),
                                                                                                                      ('Нижний Новгород', 'Приокский район', 'Воркаут', 43.967555, 56.233131, 1, true, null),
                                                                                                                      ('Нижний Новгород', '2-й м-н, Кстово, Нижегородская область', 'Тренажеры', 44.185679, 56.143924, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Богородск, Нижегородская область', 'Футбол', 43.469747, 56.100404, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Детский парк Радуга, Дзержинск, Нижегородская область', 'Тренажеры', 43.455056, 56.246494, 2, false, null),
                                                                                                                      ('Нижний Новгород', 'Приокский район', 'Волейбол', 44.009051, 56.245756, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Советский район', 'Тренажеры', 44.024551, 56.312796, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Советский район', 'Воркаут', 43.980589, 56.301189, 2, false, null),
                                                                                                                      ('Нижний Новгород', 'Автозаводский район', 'Тренажеры', 43.86042, 56.226673, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Кстово, Нижегородская область', 'Воркаут', 44.203035, 56.152653, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Кстово, Нижегородская область', 'Тренажеры', 44.200783, 56.153046, 2, true, null),
                                                                                                                      ('Нижний Новгород', 'Кстово, Нижегородская область', 'Футбол', 44.198704, 56.151992, 3, true, null),
                                                                                                                      ('Нижний Новгород', '7-й м-н, Кстово, Нижегородская область', 'Тренажеры', 44.215552, 56.158153, 2, false, null),
                                                                                                                      ('Нижний Новгород', 'Автозаводский район', 'Воркаут', 43.877872, 56.231102, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Автозаводский район', 'Волейбол', 43.868496, 56.225267, 2, true, null),
                                                                                                                      ('Нижний Новгород', 'Щербинки 2 м-н, Приокский район, Нижний Новгород', 'Воркаут', 43.960349, 56.233199, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Автозаводский район', 'Тренажеры', 43.862275, 56.229672, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Щербинки 1 м-н, Приокский район', 'Воркаут', 43.967092, 56.236859, 2, false, null),
                                                                                                                      ('Нижний Новгород', 'Соцгород-II м-н, Автозаводский район, Нижний Новгород', 'Тренажеры', 43.846186, 56.256537, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Соцгород-II м-н, Автозаводский район, Нижний Новгород', 'Воркаут', 43.86126, 56.253241, 2, false, null),
                                                                                                                      ('Нижний Новгород', 'Соцгород-II м-н, Автозаводский район, Нижний Новгород', 'Тренажеры', 43.868146, 56.254785, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Соцгород-II м-н, Автозаводский район, Нижний Новгород', 'Воркаут', 43.86478, 56.254978, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Приокский район, Нижний Новгород', 'Тренажеры', 44.016434, 56.267066, 2, true, null),
                                                                                                                      ('Нижний Новгород', '5-й (жилой район Верхние Печёры) м-н, Нижегородский район', 'Футбол', 44.069416, 56.286576, 1, true, null),
                                                                                                                      ('Нижний Новгород', '8-й (жилой район Верхние Печёры) м-н, Нижегородский район', 'Воркаут', 44.066254, 56.285125, 2, false, null),
                                                                                                                      ('Нижний Новгород', 'Московский район', 'Воркаут', 43.883656, 56.315972, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Канавинский район', 'Воркаут', 43.932656, 56.30593, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Медвежья Долина м-н, Нижегородский район', 'Футбол', 44.067405, 56.3144, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Медвежья Долина м-н, Нижегородский район', 'Тренажеры', 44.06719, 56.313128, 2, true, null),
                                                                                                                      ('Нижний Новгород', 'Канавино м-н, Канавинский район', 'Тренажеры', 43.942688, 56.307849, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Нижегородский район', 'Тренажеры', 44.015047, 56.32084, 2, true, null),
                                                                                                                      ('Нижний Новгород', 'Усиловский м-н, Нижегородский район', 'Волейбол', 44.045924, 56.316098, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Канавино м-н, Канавинский район', 'Воркаут', 43.937124, 56.308837, 2, true, null),
                                                                                                                      ('Нижний Новгород', 'Усиловский м-н, Нижегородский район', 'Воркаут', 44.042769, 56.32044, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Щербинки 2 м-н, Приокский район', 'Воркаут', 43.948268, 56.231372, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Щербинки 2 м-н, Приокский район', 'Воркаут', 43.951546, 56.233477, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Приокский район', 'Тренажеры', 43.96602, 56.233867, 2, true, null),
                                                                                                                      ('Нижний Новгород', 'Московский район', 'Футбол', 43.888449, 56.317143, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Московский район', 'Тренажеры', 43.878718, 56.332589, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Московский район', 'Воркаут', 43.872458, 56.318764, 3, true, null),
                                                                                                                      ('Нижний Новгород', 'Московский район', 'Тренажеры', 43.867513, 56.322439, 2, true, null),
                                                                                                                      ('Нижний Новгород', 'Автозаводский район', 'Воркаут', 43.867173, 56.236564, 1, true, null),
                                                                                                                      ('Нижний Новгород', '2-й (жилой район Верхние Печёры) м-н, Нижегородский район', 'Тренажеры', 44.061063, 56.298822, 2, false, null),
                                                                                                                      ('Нижний Новгород', 'Московский район', 'Тренажеры', 43.877575, 56.315192, 1, true, null),
                                                                                                                      ('Нижний Новгород', 'Московский район', 'Баскетбол', 43.872875, 56.315255, 2, true, null),
                                                                                                                      ('Нижний Новгород', 'Московский район', 'Футбол', 43.876651, 56.319104, 3, true, null);
